Autodesk.Revit.UI.RecentFileProvider.TogglePin(System.String)
toggle the pin status of recent files, only call it for UDA home
name:
Name of the recent doc
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.2

Autodesk.Revit.UI.RecentFileProvider.GetAllRecentAndSampleFiles(System.Boolean,System.Boolean)
generateThumbnails:
true to generate and return thumbnails paths as part of return, false to leave blank.
withPinStatus:
true to get pin status as part of return, false to leave blank.
Since:
2024.2